app/controllers/admin/customers_controller.rb

  def update
    @customer = Customer.find(params[:id])
    @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 1], ["updated_at", "2021-08-15 00:09:34.113566"], ["id", 1]]