app/controllers/admin/items_controller.rb

  def new
    @item = Item.new
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    @item= Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @item = Item.find(params[:id])
    @genres = Genre.all
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"

  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "is_active" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "5de819e8dfbaef4c9cdc0b3c2ec9f1ec25409f1f71573891b18a434cbf69"], ["is_active", 0], ["updated_at", "2021-08-14 23:58:18.385867"], ["id", 1]]