app/controllers/customers/sessions_controller.rb

  def reject_customer
    @customer = Customer.find_by(email: params[:customer][:email].downcase)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "eee@e.com"], ["LIMIT", 1]]