app/views/orders/new.html.erb

      <h2>注文情報画面</h2>
      <% if current_customer.cart_items.present? %>
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]

          <%= f.label :登録済み住所から選択 %><br />
          <%= f.select :address_id, options_from_collection_for_select(current_customer.addresses, :id, :address_display) %><br />
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?  [["customer_id", 6]]