app/controllers/addresses_controller.rb

    def create
       @address = Address.new(address_params)
       @address.customer_id = current_customer.id
       @addresses = current_customer.addresses
       @address.save
---
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "residence", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["name", "坂町"], ["postal_code", "1234567"], ["residence", "東京都"], ["created_at", "2021-08-19 11:06:20.344989"], ["updated_at", "2021-08-19 11:06:20.344989"]]

    def update
      @address = Address.find(params[:id])
      @address.update(address_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "postal_code" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["postal_code", "1234569"], ["updated_at", "2021-08-19 11:28:47.497667"], ["id", 4]]

    def destroy
      @address = Address.find(params[:id])
      @address.destroy
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 5]]