app/controllers/cart_items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 2]]
SELECT SUM(cart_item) FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 2]]
---
  def index
    @cart_items = current_customer.cart_items
    #sumメソッド：合計金額を出す
     @total_price = @cart_items.sum{|cart_item|cart_item.item.add_tax_price * cart_item.amount * 1.1}

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."item_id" = ? LIMIT ?  [["item_id", 1], ["LIMIT", 1]]
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["customer_id", 5], ["amount", 3], ["created_at", "2021-08-18 23:35:04.113514"], ["updated_at", "2021-08-18 23:35:04.113514"]]
---
  def create
    @cart_item = current_customer.cart_items.build(cart_item_params)
    @cart_items = current_customer.cart_items.all
    #カートの中に同じ商品が重複しないようにして数量を合わせる
    not_true = false

      @cart_items.each do |cart_item|
        if cart_item.item_id == @cart_item.item_id
          new_amount = cart_item.amount + @cart_item.amount
          cart_item.update_attribute(:amount, new_amount)
          not_true = true
        end
      end
      if !not_true
        @cart_item.save

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 1], ["updated_at", "2021-08-18 23:48:22.684521"], ["id", 28]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item.update(cart_item_params)

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 28]]
---
  def destroy
    @cart_item = CartItem.find(params[:id])
    @cart_item.destroy

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 5]]
---
  def destroy_all
    @cart_item = current_customer.cart_items
    @cart_item.destroy_all