app/controllers/cart_items_controller.rb

  def destroy
    @cart_item = current_cart
    @cart_item.destroy
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]