app/controllers/customers_controller.rb

UPDATE "customers" SET "residence" = ?, "phone_number" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["residence", "1234567"], ["phone_number", "09007875877"], ["updated_at", "2021-08-14 23:22:54.914958"], ["id", 1]]
---
  def update
    @customer = current_customer
    @customer.update(customer_params)

UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 0], ["updated_at", "2021-08-15 04:26:26.458492"], ["id", 3]]
---
  def withdraw
    @customer = current_customer
    @customer.update(is_active: false)