app/controllers/orders_controller.rb

  def index
    @orders = current_customer.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 6]]

  def new
    @order = Order.new
    @customer = current_customer
    @addresses = Address.find_by(customer_id: current_customer)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ? LIMIT ?  [["customer_id", 6], ["LIMIT", 1]]

  def create
    @order = Order.new(order_params)
    @order.customer_id = current_customer.id
    #byebug
    @order.save
    # カート商品の情報を注文商品に移動
    @cart_items = current_customer.cart_items
       @cart_items.each do |cart_item|
        OrderDetail.create(
      item:  cart_item.item,
      order:    @order,
      amount: cart_item.amount

    )
  end
    @cart_items.destroy_all
---
INSERT INTO "orders" ("customer_id", "total_payment", "postal_code", "address", "name", "payment_method", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 6]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 61]]

  def confirum
    @cart_items = current_customer.cart_items
    @total_price = @cart_items.sum{|cart_item|cart_item.item.add_tax_price * cart_item.amount * 1.1}
    @order = Order.new(order_params)
      #addressesにresidenceの値
      if params[:order][:addresses] == "residence"
        @order.postal_code = current_customer.postal_code
        @order.address = current_customer.residence
        @order.name = current_customer.first_name + current_customer.last_name

      #addressesにaddressの値
      elsif params[:order][:addresses] == "addresses"
        @addresses = Address.find(params[:order][:address_id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 5]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE (8) LIMIT ?  [["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]