app/controllers/orders_controller.rb

  def confirum
    @cart_items = current_customer.cart_items
    @total_price = @cart_items.sum{|cart_item|cart_item.item.add_tax_price * cart_item.amount * 1.1}
    @order = Order.new(order_params)
      #addressesにresidenceの値
      if params[:order][:addresses] == "residence"
        @order.postal_code = current_customer.postal_code
        @order.address = current_customer.residence
        @order.name = current_customer.first_name + current_customer.last_name

      #addressesにaddressの値
      elsif params[:order][:addresses] == "addresses"
        @addresses = Address.find(params[:order][:address_id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]